# Создать калькулятор для работы с рациональными и комплексными числами, организовать меню, добавив в неё систему логирования.
# В рамках этого обсуждения надо нарисовать “архитектуру” (например, в виде блок-схемы) для работы данного приложения.

# Калькулятор создан
# данные из лога:
# 18:00;10.0; * 20.0; = ('*', (200.0, 4))18:05 10.0 * 20.0 = (200.0, 4)18:05 2.0 / 4.0 = 0.518:05 2.0 / 2.0 = 1.018:06 2.0 * 2.0 = (4.0, 4)18:06 2.0 + 2.0 = 4.018:06 2.0 - 2.0 = 0.018:07 2.0 * 2.0 = 4.018:07 5.0 * 5.0 = 25.018:08 10.0 * 20.0 = 200.018:18 -5.0 * -5.0 = 25.0 
# 18:18 -5.0 - -3.0 = -2.0 
# 18:18 1.2 / 1.2 = 1.0 
# 18:19 1.5 - 2.3 = -0.7999999999999998 
# 18:45 2.0 * 3.0 = 6.0 